IDENTIFICATION DIVISION.
PROGRAM-ID. COBCalculator.

DATA DIVISION.
WORKING-STORAGE SECTION.
   01 WS-FLOAT1 PIC S9(7)V99.
   01 WS-FLOAT2 PIC S9(7)V99.
   01 WS-TYPE PIC 9(1).
   01 WS-RESULT PIC S9(7)V99.

PROCEDURE DIVISION.
BEGIN.
   DISPLAY 'Enter the first number: '.
   ACCEPT WS-FLOAT1.

   DISPLAY 'Choose between:'.
   DISPLAY '1) Addition'.
   DISPLAY '2) Subtraction'.
   DISPLAY '3) Multiplication'.
   DISPLAY '4) Division'.
   ACCEPT WS-TYPE.

   DISPLAY 'Enter the second number: '.
   ACCEPT WS-FLOAT2.

   EVALUATE WS-TYPE
      WHEN 1
         ADD WS-FLOAT1 TO WS-FLOAT2 GIVING WS-RESULT
      WHEN 2
         SUBTRACT WS-FLOAT2 FROM WS-FLOAT1 GIVING WS-RESULT
      WHEN 3
         MULTIPLY WS-FLOAT1 BY WS-FLOAT2 GIVING WS-RESULT
      WHEN 4
         DIVIDE WS-FLOAT1 BY WS-FLOAT2 GIVING WS-RESULT
      WHEN OTHER
         DISPLAY 'Invalid function'
         STOP RUN
   END-EVALUATE.
   
   DISPLAY WS-RESULT.

STOP RUN.

